In [6]:
#lien vers le modèle conceptuel retenu pour ce travail: https://github.com/PAWTOSKI/simplon/blob/master/modele_conceptuel_BD_netflix.png

import pandas as pd
import re
import sqlalchemy

path="/home/pw/Documents/cours_simplon/exercice_simplon/ressources/netflix_titles.csv"
data=pd.read_csv(path, encoding='utf-8', sep=';') # encodage en format 'UTF-8 pour éviter toute erreur de formatage sur le reste du processus' 
data=data.reset_index(drop=True) # réinitialisation de l'index pour 
data

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,81145628,Movie,Norm of the North: King Sized Adventure,"Richard Finn, Tim Maltby","Alan Marriott, Andrew Toth, Brian Dobson, Cole...","United States, India, South Korea, China","September 9, 2019",2019.0,TV-PG,90 min,"Children & Family Movies, Comedies",Before planning an awesome wedding for his gra...
1,80117401,Movie,Jandino: Whatever it Takes,NaN,Jandino Asporaat,United Kingdom,"September 9, 2016",2016.0,TV-MA,94 min,Stand-Up Comedy,Jandino Asporaat riffs on the challenges of ra...
2,70234439,TV Show,Transformers Prime,NaN,"Peter Cullen, Sumalee Montano, Frank Welker, J...",United States,"September 8, 2018",2013.0,TV-Y7-FV,1 Season,Kids' TV,"With the help of three human allies, the Autob..."
3,80058654,TV Show,Transformers: Robots in Disguise,NaN,"Will Friedle, Darren Criss, Constance Zimmer, ...",United States,"September 8, 2018",2016.0,TV-Y7,1 Season,Kids' TV,When a prison ship crash unleashes hundreds of...
4,80125979,Movie,#realityhigh,Fernando Lebrija,"Nesta Cooper, Kate Walsh, John Michael Higgins...",United States,"September 8, 2017",2017.0,TV-14,99 min,Comedies,When nerdy high schooler Dani finally attracts...
...,...,...,...,...,...,...,...,...,...,...,...,...
6230,80000063,TV Show,Red vs. Blue,NaN,"Burnie Burns, Jason Saldaña, Gustavo Sorola, G...",United States,NaN,2015.0,NR,13 Seasons,"TV Action & Adventure, TV Comedies, TV Sci-Fi ...","This parody of first-person shooter games, mil..."
6231,70286564,TV Show,Maron,NaN,"Marc Maron, Judd Hirsch, Josh Brener, Nora Zeh...",United States,NaN,2016.0,TV-MA,4 Seasons,TV Comedies,"Marc Maron stars as Marc Maron, who interviews..."
6232,80116008,Movie,Little Baby Bum: Nursery Rhyme Friends,NaN,NaN,NaN,NaN,2016.0,NaN,60 min,Movies,Nursery rhymes and original music for children...
6233,70281022,TV Show,A Young Doctor's Notebook and Other Stories,NaN,"Daniel Radcliffe, Jon Hamm, Adam Godley, Chris...",United Kingdom,NaN,2013.0,TV-MA,2 Seasons,"British TV Shows, TV Comedies, TV Dramas","Set during the Russian Revolution, this comic ..."
6234,70153404,TV Show,Friends,NaN,"Jennifer Aniston, Courteney Cox, Lisa Kudrow, ...",United States,NaN,2003.0,TV-14,10 Seasons,"Classic & Cult TV, TV Comedies",This hit sitcom follows the merry misadventure...

In [7]:
#20 Créez un dataframe nommé "show_listed_in" ayant pour seul colonne "show_id" et 'listed_in'

list_category=list(data.loc[0,'listed_in'].split(','))  #création de la liste des catégories (avec redondances), par un découpage selon le marqueur ', '
list_show_id=[ data.loc[0,'show_id'] for i in range(0,len(list_category)) ]
show_listed_in=pd.DataFrame({'show_id': list_show_id ,'listed_in': list_category }, columns=['show_id','listed_in'])
show_listed_in

    show_id                 listed_in
0  81145628  Children & Family Movies
1  81145628                  Comedies

In [8]:
data_category=pd.DataFrame({'show_id': [] ,'listed_in':[]} )
temp_=data[data['listed_in'].notna()].reset_index() ### utilisation du reset_index car le notna() va laisser des lignes fantômes sans lignes d'index

for i in range(0, temp_.shape[0]) : ## déclinaison de ce qui a été fait à la question 20 sur une boucle à n itérations avec n=nombre de lignes du dataframe 'data'
    
    list_temp=temp_.loc[i,'listed_in'].split(', ')
    list_show_id=[ temp_.loc[i,'show_id'] for m in range(0,len(list_temp)) ]
    temp2_=pd.DataFrame({'show_id': list_show_id ,'listed_in': list_temp })
    data_category=data_category.append(temp2_, ignore_index=True)

data_category


# CORECTION ##

#tmp2 = donnees.loc[donnees["listed_in"].notna()][['show_id', 'listed_in']]

#show_listed_in = pd.DataFrame(columns = ['show_id', 'listed_in'])


#for i in range(tmp2.shape[0]):
    #tmp = tmp2.iloc[i]["listed_in"].split(", ")
    #show_id = [tmp2.iloc[i]["show_id"]]*len(tmp)
    #df = pd.DataFrame({'show_id': show_id,'listed_in': tmp}, columns = ['show_id', 'listed_in'])
   # show_listed_in = show_listed_in.append(df, ignore_index=True)
#type(show_listed_in)

          show_id                 listed_in
0      81145628.0  Children & Family Movies
1      81145628.0                  Comedies
2      80117401.0           Stand-Up Comedy
3      70234439.0                  Kids' TV
4      80058654.0                  Kids' TV
...           ...                       ...
13665  70281022.0          British TV Shows
13666  70281022.0               TV Comedies
13667  70281022.0                 TV Dramas
13668  70153404.0         Classic & Cult TV
13669  70153404.0               TV Comedies

[13670 rows x 2 columns]

In [9]:
#21 créez un dataframe nommé "listed_in" ayant pour colonne "liste_in_id" et "listed_in"

listed_in=data_category['listed_in'].drop_duplicates().reset_index(drop=True).reset_index() ### à la base étant une série, la première rest_index va réinitialiser l'index ( allant de n à 3000 et +) une fois sans l'insérer dans la table de données ( l'index passe ici de de 0 à 41), 
#et la deuxième reset_index permet d'insérer une fois l'index dans la Serie qui devient du coup un dataframme.
print(type(listed_in))
listed_in=listed_in.rename(columns={'index':'fk_ca_id'}) 
listed_in


#correction question 21 

#print(type(show_listed_in['listed_in']))
#listed_in = show_listed_in['listed_in'].drop_duplicates().reset_index(drop=True).reset_index()
#listed_in = listed_in.rename(columns={"index": "listed_in_id"})
#show_listed_in = show_listed_in.merge(listed_in, left_on='listed_in',right_on='listed_in', how='left')
#show_listed_in
#del show_listed_in['listed_in']"""

<class 'pandas.core.frame.DataFrame'>

    fk_ca_id                     listed_in
0          0      Children & Family Movies
1          1                      Comedies
2          2               Stand-Up Comedy
3          3                      Kids' TV
4          4                Crime TV Shows
5          5        International TV Shows
6          6     Spanish-Language TV Shows
7          7          International Movies
8          8              Sci-Fi & Fantasy
9          9                     Thrillers
10        10                    Docuseries
11        11           Science & Nature TV
12        12            Action & Adventure
13        13                        Dramas
14        14                   Cult Movies
15        15            Independent Movies
16        16               Romantic Movies
17        17                 Documentaries
18        18                 Horror Movies
19        19             Romantic TV Shows
20        20                   TV Comedies
21        21                     TV Dramas
22        22                  TV Thrillers
23        23                  TV Mysteries
24        24              British TV Shows
25        25              Music & Musicals
26        26                    Reality TV
27        27         TV Action & Adventure
28        28                Anime Features
29        29                 Teen TV Shows
30        30          Faith & Spirituality
31        31               Korean TV Shows
32        32                  Anime Series
33        33                  LGBTQ Movies
34        34                     TV Horror
35        35                        Movies
36        36  Stand-Up Comedy & Talk Shows
37        37           TV Sci-Fi & Fantasy
38        38                Classic Movies
39        39                 Sports Movies
40        40                      TV Shows
41        41             Classic & Cult TV

In [10]:
#data_l=pd.merge(data_category, listed_in, on=['listed_in']).drop(columns='listed_in').astype('int64')

data_category = data_category.merge(listed_in, left_on='listed_in',right_on='listed_in', how='left').rename( columns={'show_id':'fk_show_id'}) #renommage de la colonne 'show_id' selon la convention établie par le modèle logique sur SQL
data_category

       fk_show_id                 listed_in  fk_ca_id
0      81145628.0  Children & Family Movies         0
1      81145628.0                  Comedies         1
2      80117401.0           Stand-Up Comedy         2
3      70234439.0                  Kids' TV         3
4      80058654.0                  Kids' TV         3
...           ...                       ...       ...
13665  70281022.0          British TV Shows        24
13666  70281022.0               TV Comedies        20
13667  70281022.0                 TV Dramas        21
13668  70153404.0         Classic & Cult TV        41
13669  70153404.0               TV Comedies        20

[13670 rows x 3 columns]

In [11]:
#22 faire de même avec les colonnes director et cast en créant des dataframe qui leur sont dédiés
#A) colonne "director" 

data_director=pd.DataFrame({"show_id":[], "list_director":[] } )
temp_=data[data['director'].notna()].reset_index() ### utilisation du reset_index car le notna() va laisser des lignes fantômes sans lignes d'index
for i in range(0, temp_.shape[0]) :


    list_temp=temp_.loc[i,'director'].split(', ')
    list_show_id=[ temp_.loc[i,'show_id'] for m in range(0,len(list_temp)) ]
    temp2_=pd.DataFrame({'show_id': list_show_id ,'list_director': list_temp })
    data_director=data_director.append(temp2_, ignore_index=True)

data_director

         show_id         list_director
0     81145628.0          Richard Finn
1     81145628.0            Tim Maltby
2     80125979.0      Fernando Lebrija
3     70304989.0           Gabe Ibáñez
4     80164077.0          Rodrigo Toro
...          ...                   ...
4847  80164216.0         Thomas Astruc
4848  80115328.0  Vikramaditya Motwane
4849  80115328.0        Anurag Kashyap
4850  80176842.0            Jung-ah Im
4851  80126599.0             Onur Ünlü

[4852 rows x 2 columns]

In [12]:
listed_in_d=data_director['list_director'].drop_duplicates() ### !!!!! attention il y a  2 déclinaisons d'un même types équivalent :'Comedies' => utilisation de pd.replace
listed_in_d=listed_in_d.reset_index().rename(columns={'index':'fk_director_id'})
listed_in_d

      fk_director_id     list_director
0                  0      Richard Finn
1                  1        Tim Maltby
2                  2  Fernando Lebrija
3                  3       Gabe Ibáñez
4                  4      Rodrigo Toro
...              ...               ...
3650            4843       James Hawes
3651            4844        Jung-ah Im
3652            4845       Seung-uk Jo
3653            4846   Andy Devonshire
3654            4851         Onur Ünlü

[3655 rows x 2 columns]

In [13]:
data_d=data_director.merge(listed_in_d, left_on='list_director',right_on='list_director', how='left').rename(columns={'show_id':'fk_show_id'})
data_d

      fk_show_id         list_director  fk_director_id
0     81145628.0          Richard Finn               0
1     81145628.0            Tim Maltby               1
2     80125979.0      Fernando Lebrija               2
3     70304989.0           Gabe Ibáñez               3
4     80164077.0          Rodrigo Toro               4
...          ...                   ...             ...
4847  80164216.0         Thomas Astruc            3836
4848  80115328.0  Vikramaditya Motwane             757
4849  80115328.0        Anurag Kashyap             704
4850  80176842.0            Jung-ah Im            4844
4851  80126599.0             Onur Ünlü            4851

[4852 rows x 3 columns]

In [22]:
#B) colonne "cast "

data_actor=pd.DataFrame({"show_id":[], "actor_name":[] } )
temp_=data[data['cast'].notna()].reset_index() ### utilisation du reset_index car le notna() va laisser des lignes fantômes sans lignes d'index
for i in range(0, temp_.shape[0]) :

    list_temp=temp_.loc[i,'cast'].split(', ')
    list_show_id=[ temp_.loc[i,'show_id'] for m in range(0,len(list_temp)) ]
    temp2_=pd.DataFrame({'show_id': list_show_id ,'actor_name': list_temp })
    data_actor=data_actor.append(temp2_, ignore_index=True)

print('ok')

data_actor

ok

          show_id        actor_name
0      81145628.0     Alan Marriott
1      81145628.0       Andrew Toth
2      81145628.0      Brian Dobson
3      81145628.0       Cole Howard
4      81145628.0  Jennifer Cameron
...           ...               ...
44306  70153404.0     Courteney Cox
44307  70153404.0       Lisa Kudrow
44308  70153404.0      Matt LeBlanc
44309  70153404.0     Matthew Perry
44310  70153404.0   David Schwimmer

[44311 rows x 2 columns]

In [15]:
listed_in_c=data_actor['actor_name'].drop_duplicates()

listed_in_c=listed_in_c.reset_index().rename(columns={'index':'fk_ac_id', 'list_actor':'actor_name'}) # rennommage des colonnes afin que leurs labels correspondent à celles définies dans le modèle sql

listed_in_c

       fk_ac_id        actor_name
0             0     Alan Marriott
1             1       Andrew Toth
2             2      Brian Dobson
3             3       Cole Howard
4             4  Jennifer Cameron
...         ...               ...
27400     44300   Rosie Cavaliero
27401     44301  Vicki Pepperdine
27402     44302   Margaret Clunie
27403     44303         Tim Steed
27404     44309     Matthew Perry

[27405 rows x 2 columns]

In [16]:
#data_c=pd.merge(data_cast, listed_in_c, left_on='listed_in', right_on='listed_in').drop(columns=['cast']).astype('int64')
print(data_actor.columns)
data_a=data_actor.merge(listed_in_c, left_on='actor_name',right_on='actor_name', how='left').rename( columns={'show_id':'fk_show_id'})
data_a

Index(['show_id', 'actor_name'], dtype='object')

       fk_show_id        actor_name  fk_ac_id
0      81145628.0     Alan Marriott         0
1      81145628.0       Andrew Toth         1
2      81145628.0      Brian Dobson         2
3      81145628.0       Cole Howard         3
4      81145628.0  Jennifer Cameron         4
...           ...               ...       ...
44306  70153404.0     Courteney Cox      5477
44307  70153404.0       Lisa Kudrow     11120
44308  70153404.0      Matt LeBlanc      5199
44309  70153404.0     Matthew Perry     44309
44310  70153404.0   David Schwimmer      4287

[44311 rows x 3 columns]

In [17]:
#bonus : création du tableau relationnel "catalogue_country"

data_country=pd.DataFrame({"show_id":[], "list_country":[] } )
print('ok')
temp_=data[data['country'].notna()].reset_index() ### utilisation du reset_index car le notna() va laisser des lignes fantômes sans lignes d'index
for i in range(0, temp_.shape[0]) :

    list_temp=temp_.loc[i,'country'].split(', ')
    list_show_id=[ temp_.loc[i,'show_id'] for m in range(0,len(list_temp)) ]
    temp2_=pd.DataFrame({'show_id': list_show_id ,'list_country': list_temp })
    data_country=data_country.append(temp2_, ignore_index=True)


data_country.head(40)

ok

       show_id    list_country
0   81145628.0   United States
1   81145628.0           India
2   81145628.0     South Korea
3   81145628.0           China
4   80117401.0  United Kingdom
5   70234439.0   United States
6   80058654.0   United States
7   80125979.0   United States
8   80163890.0           Spain
9   70304989.0        Bulgaria
10  70304989.0   United States
11  70304989.0           Spain
12  70304989.0          Canada
13  80164077.0           Chile
14  80117902.0   United States
15  70304990.0   United States
16  70304990.0  United Kingdom
17  70304990.0         Denmark
18  70304990.0          Sweden
19  70299204.0     Netherlands
20  70299204.0         Belgium
21  70299204.0  United Kingdom
22  70299204.0   United States
23  80057969.0          France
24  80057969.0         Belgium
25  80060297.0   United States
26  80046728.0          France
27  80046728.0         Belgium
28  80046727.0   United States
29  80046727.0         Uruguay
30  70304988.0   United States
31  80057700.0   United States
32  80045922.0   United States
33  80203094.0  United States,
34  70241607.0        Thailand
35  80988892.0           China
36  80988892.0          Canada
37  80988892.0   United States
38  80239639.0   United States
39  80159586.0         Belgium

In [18]:
listed_in_country=data_country['list_country'].drop_duplicates().reset_index(drop=True) ### !!!!! attention il y a  2 déclinaisons d'un même types équivalent :'Comedies' => utilisation de pd.replace
listed_in_country=listed_in_country.reset_index().rename(columns={'index':'fk_co_id'}).drop_duplicates()
listed_in_country

     fk_co_id    list_country
0           0   United States
1           1           India
2           2     South Korea
3           3           China
4           4  United Kingdom
..        ...             ...
108       108         Bermuda
109       109         Ecuador
110       110           Syria
111       111          Kuwait
112       112          Cyprus

[113 rows x 2 columns]

In [20]:
data_co=data_country.merge(listed_in_country, left_on='list_country',right_on='list_country', how='left').rename( columns={'show_id':'fk_show_id'})
data_co

      fk_show_id    list_country  fk_co_id
0     81145628.0   United States         0
1     81145628.0           India         1
2     81145628.0     South Korea         2
3     81145628.0           China         3
4     80117401.0  United Kingdom         4
...          ...             ...       ...
7174  80005756.0       Australia        40
7175  80000063.0   United States         0
7176  70286564.0   United States         0
7177  70281022.0  United Kingdom         4
7178  70153404.0   United States         0

[7179 rows x 3 columns]

In [25]:
# sous-question: retirer les colonnes 'listed_in', 'cast' et 'director'

data['duration']=data[data['duration'].notna()]['duration'].str.replace(r'( )?Season(s)?| min| ', '')
data['release_year']=data[data['release_year'].notna()]['release_year'].astype('int')
data['date_added']=pd.to_datetime(data['date_added'])

data=data.drop(columns=['cast', 'director', 'listed_in', 'country'])
data

,show_id,type,title,date_added,release_year,rating,duration,description
0,81145628,Movie,Norm of the North: King Sized Adventure,2019-09-09,2019.0,TV-PG,90,Before planning an awesome wedding for his gra...
1,80117401,Movie,Jandino: Whatever it Takes,2016-09-09,2016.0,TV-MA,94,Jandino Asporaat riffs on the challenges of ra...
2,70234439,TV Show,Transformers Prime,2018-09-08,2013.0,TV-Y7-FV,1,"With the help of three human allies, the Autob..."
3,80058654,TV Show,Transformers: Robots in Disguise,2018-09-08,2016.0,TV-Y7,1,When a prison ship crash unleashes hundreds of...
4,80125979,Movie,#realityhigh,2017-09-08,2017.0,TV-14,99,When nerdy high schooler Dani finally attracts...
...,...,...,...,...,...,...,...,...
6230,80000063,TV Show,Red vs. Blue,NaT,2015.0,NR,13,"This parody of first-person shooter games, mil..."
6231,70286564,TV Show,Maron,NaT,2016.0,TV-MA,4,"Marc Maron stars as Marc Maron, who interviews..."
6232,80116008,Movie,Little Baby Bum: Nursery Rhyme Friends,NaT,2016.0,NaN,60,Nursery rhymes and original music for children...
6233,70281022,TV Show,A Young Doctor's Notebook and Other Stories,NaT,2013.0,TV-MA,2,"Set during the Russian Revolution, this comic ..."
6234,70153404,TV Show,Friends,NaT,2003.0,TV-14,10,This hit sitcom follows the merry misadventure...

In [281]:
#intégration des tableaux primaires

path="mysql+pymysql://PW:wilfredi1@localhost:3306/netflix"
engine=sqlalchemy.create_engine(path)

data.to_sql('catalogue', con=engine, if_exists='append', index=False)

listed_in_country=listed_in_country.drop_duplicates() # suppression des doublons de combinaisons de valeurs
listed_in_country.rename(columns={'fk_co_id':'co_id', 'list_country':'co_name'}). to_sql('country', con=engine, if_exists='append', index=False)

listed_in_c=listed_in_c.drop_duplicates()
listed_in_c.rename(columns={'fk_ac_id':'ac_id'}).to_sql('actor', con=engine ,if_exists='append', index=False)

liste_in=listed_in.drop_duplicates()
listed_in.rename(columns={'fk_ca_id':'ca_id', 'listed_in':'ca_name'}).to_sql('category', con=engine ,if_exists='append', index=False)

listed_in_d=listed_in_d.drop_duplicates()
listed_in_d.rename(columns={'fk_director_id':'di_id', 'list_director':'di_name'}).to_sql('director', con=engine, if_exists='append', index=False)

In [282]:
#intégration des tableaux relationnelles 

#l'opération "drop_duplicates().to_sql"  est répétée pour chaque création de tableau relationnelle, afin d'éviter 
#tout doublon de lignes et lignes vides 


data_a=data_a[['fk_show_id', 'fk_ac_id']].drop_duplicates().to_sql('catalogue_actor', con=engine, if_exists='append',index=False)

data_co[['fk_show_id', 'fk_co_id']].drop_duplicates().dropna().astype('int').to_sql('catalogue_country', con=engine, if_exists='append',index=False)

data_d[['fk_show_id', 'fk_director_id']].drop_duplicates().dropna().to_sql('catalogue_director', con=engine ,if_exists='append', index=False)

data_category[['fk_show_id', 'fk_ca_id']].drop_duplicates().dropna().astype('int').to_sql('catalogue_category', con=engine, if_exists='append', index=False)